# Задача 14 Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

print("Введите число N")
N = int(input())
a = 2
count = 0
b = 0
while (N >= count):
    b = a * count
    count += 1
    print("Степень двойки -", count, "равна", b)